[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:25:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                    <Form.Group className="mb-3" >
-                        <Form.Label htmlFor="id">MenuReview</Form.Label>
-                        <Form.Control
-                            data-testid={testIdPrefix + "-id"}
-                            id="id"
-                            type="text"
-                            {...register("id")}
-                            value={initialContents.id}
-                            disabled
-                        />
-                    </Form.Group>
-            )}
+            {false}
 
             <Form.Group className="mb-3" >
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:25:14
     return (
         <Form onSubmit={handleSubmit(submitAction)}>
 
-            {initialContents && (
-                    <Form.Group className="mb-3" >
-                        <Form.Label htmlFor="id">MenuReview</Form.Label>
-                        <Form.Control
-                            data-testid={testIdPrefix + "-id"}
-                            id="id"
-                            type="text"
-                            {...register("id")}
-                            value={initialContents.id}
-                            disabled
-                        />
-                    </Form.Group>
-            )}
+            {true}
 
             <Form.Group className="mb-3" >
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Error: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:47:35
                     type="text"
                     isInvalid={Boolean(errors.itemId)}
                     {...register("itemId", {
-                        required: "Item ID is required."
+                        required: ""
                     })}
                 />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Item ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:62:51
                     id="reviewerEmail"
                     type="text"
                     isInvalid={Boolean(errors.reviewerEmail)}
-                    {...register("reviewerEmail", {
-                        required: "Reviewer email is required.",
-                        // maxLength : {
-                        //     value: 30,
-                        //     message: "Max length 30 characters"
-                        // }
-                    })}
+                    {...register("reviewerEmail", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:100:35
                     type="datetime-local"
                     isInvalid={Boolean(errors.dateReviewed)}
                     {...register("dateReviewed", { 
-                        required: true, pattern: isodate_regex 
+                        required: false, pattern: isodate_regex 
                     })}
                 />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TypeError: e is not a function
