[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:66:55
                     id="diningCommonsCode"
                     type="text"
                     isInvalid={Boolean(errors.diningCommonsCode)}
-                    {...register("diningCommonsCode", {
-                        required: "Dining Commons Code is required.",
-                    })}
+                    {...register("diningCommonsCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Dining Commons Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
