[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:35:45
                     id="orgCode"
                     type="text"
                     isInvalid={Boolean(errors.orgCode)}
-                    {...register("orgCode", {
-                        required: "orgCode is required.",
-                    })}
+                    {...register("orgCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganiztionForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /orgCode is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:52:57
                     id="orgTranslationShort"
                     type="text"
                     isInvalid={Boolean(errors.orgTranslationShort)}
-                    {...register("orgTranslationShort", {
-                        required: "orgTranslationShort is required.",
-                    })}
+                    {...register("orgTranslationShort", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganiztionForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslationShort is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:53:35
                     type="text"
                     isInvalid={Boolean(errors.orgTranslationShort)}
                     {...register("orgTranslationShort", {
-                        required: "orgTranslationShort is required.",
+                        required: "",
                     })}
                 />
killedBy: UCSBOrganiztionForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslationShort is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/UCSBOrganization/UCSBOrganizationForm.js:89:22
                     })}
                 />
                 <Form.Control.Feedback type="invalid">
-                    {errors.inactive?.message} {'Inactive must be true or false'}
+                    {errors.inactive.message} {'Inactive must be true or false'}
                 </Form.Control.Feedback>
             </Form.Group>
killedBy: UCSBOrganiztionForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
