[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (item) => ({
-    url: "/api/ucsbdiningcommonsmenuitems/post",
-    method: "POST",
-    params: {
-     name: item.name,
-     diningCommonsCode: item.diningCommonsCode,
-     station: item.station,
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (item) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:11:13
 
   const objectToAxiosParams = (item) => ({
     url: "/api/ucsbdiningcommonsmenuitems/post",
-    method: "POST",
+    method: "",
     params: {
      name: item.name,
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:12:13
   const objectToAxiosParams = (item) => ({
     url: "/api/ucsbdiningcommonsmenuitems/post",
     method: "POST",
-    params: {
-     name: item.name,
-     diningCommonsCode: item.diningCommonsCode,
-     station: item.station,
-    }
+    params: {}
   });
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "diningCommonsCode": "Ortega",
-   "name": "Pizza",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:19:31
     }
   });
 
-  const onSuccess = (item) => {
-    toast(`New Item Created - id: ${item.id} name: ${item.name} diningCommonsCode: ${item.diningCommonsCode} station: ${item.station}`);
-  }
+  const onSuccess = (item) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /diningcommonsmenuitem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Item Created - id: 1 name: Pizza diningCommonsCode: Ortega station: Pizza"

Number of calls: 0
