[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/ucsbdiningcommonsmenuitems?id=${id}`],
-            {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/ucsbdiningcommonsmenuitems`,
-                params: {
-                    id
-                }
-            }
+            {}
         );
 
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (item) => ({
-        url: "/api/ucsbdiningcommonsmenuitems",
-        method: "PUT",
-        params: {
-            id: item.id,
-        },
-        data: {
-            name: item.name,
-            diningCommonsCode: item.diningCommonsCode,
-            station: item.station,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (item) => {
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Item Updated - id: 17 name: Pasta diningCommonsCode: B station: Pasta"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:27:17
     const objectToAxiosPutParams = (item) => ({
         url: "/api/ucsbdiningcommonsmenuitems",
         method: "PUT",
-        params: {
-            id: item.id,
-        },
+        params: {},
         data: {
             name: item.name,
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "id": 17,
- }

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:37:33
         }
     });
 
-    const onSuccess = (item) => {
-        toast(`Item Updated - id: ${item.id} name: ${item.name} diningCommonsCode: ${item.diningCommonsCode} station: ${item.station}`);
-    }
+    const onSuccess = (item) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit Item</h1>
                 {
-                    item && <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={item} />
+                    item || <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={item} />
                 }
             </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBDiningCommonsMenuItemForm-name" id="name" name="name" type="text" /> instead

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:63:21
             <div className="pt-2">
                 <h1>Edit Item</h1>
                 {
-                    item && <UCSBDiningCommonsMenuItemForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={item} />
+                    false
                 }
             </div>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
