[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:17:35
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/ucsbdiningcommonsmenuitems/all"],
-            { method: "GET", url: "/api/ucsbdiningcommonsmenuitems/all" },
+            { method: "GET", url: "" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: UCSBDiningCommonsMenuitemIndexPage tests renders three items correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:17:23
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/ucsbdiningcommonsmenuitems/all"],
-            { method: "GET", url: "/api/ucsbdiningcommonsmenuitems/all" },
+            { method: "", url: "/api/ucsbdiningcommonsmenuitems/all" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: UCSBDiningCommonsMenuitemIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/ucsbdiningcommonsmenuitems/all"
Received string:    "Error communicating with backend via  on /api/ucsbdiningcommonsmenuitems/all"

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:22:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/diningcommonsmenuitem/create"
-                    style={{ float: "right" }}
-                >
-                    Create Menu Item
-                </Button>
-            )
-        } 
-    }
+    const createButton = () => {}
 
     return (
killedBy: UCSBDiningCommonsMenuitemIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Menu Item/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:28:28
                 <Button
                     variant="primary"
                     href="/diningcommonsmenuitem/create"
-                    style={{ float: "right" }}
+                    style={{}}
                 >
                     Create Menu Item
killedBy: UCSBDiningCommonsMenuitemIndexPage tests Renders with Create Button for admin user
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
